Autodesk.Revit.UI.RevitFileInfo.SetLocalPath(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.RevitFileInfo.IsPinned
If it is pinned.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.IsCloud
If it is a cloud file.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.IsWorkshared
If it is a workshared file.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.Size
The size of the recent file.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.ModelType
The model type of the recent file.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.LastModifiedTime
The last modified time of the recent file.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.ThumbnailPath
The path of the thumbnail file.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.ExtensionType
The extension type of the recent file.
such as .rfa /.rvt
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.LocalPath
The path of the cached file.
If a cloud file, the path looks like "%USERPROFILE%\AppData\Local
\Autodesk\Revit\{Revit Version}\CollaborationCache\YZVYJQWWXXXX
{GUID}\{GUID}.rvt"
if a local file, localPath and path are the same.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.Path
The path of the recent file.
If a cloud file, the path looks like "cld://region/{GUID}Shanghai%20Design%20Center/{GUID}4walls.rvt"
If a local file, the path looks like "c:\4wall.rvt".
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.Name
The name of the recent file.
If a cloud file, it looks like "Autodesk Docs://Shanghai Design Center/4walls.rvt"
If a local file, path, localPath and name are all the same.
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.DisplayName
The display Name of the recent file.
such as 4walls (no extention)
Since:
2019

Autodesk.Revit.UI.RevitFileInfo
A class contains data of Revit File.
Since:
2019